palindrom.yml
config:
  target: "http://localhost:8080/index"
  processor: "./palindrom.js"
  phases:
    - duration: 1
      arrivalRate: 1
  palindrom:
    timeout: 5000
    onPatchReceived: "logPatchReceived"
scenarios:
  - engine: "palindrom"
    name: "Insert / update / delete N items"
    weight: 39
    flow:
      - loop:
          - trigger: "/Playground_0/InsertTrigger$"
          #- updateModelFunction: "insertItem"
          - trigger: "/Playground_0/EmptyTrigger$"
          #- updateModelFunction: "emptyTrigger"
          - function: "saveInsertedItemInfo"
          - morphUrl: "{{ EditInsertedItemUri }}"
          #- updateModelFunction: "setEditedItemGuid"
          - update: {"/Playground_0/Item/Guid$" : "{{ Guid }}"}
          - updateModelFunction: "setEditedItemIndex"
          - think: 1
          - trigger: "/Playground_0/SaveTrigger$"
          #- updateModelFunction: "saveEditedItem"
          - think: 1
          - morphUrl: "/index"
          #- updateModelFunction: "deleteSavedItem"
        count: 1